Revit 2024 API
SymbolTypeId Class
 This class contains constants identifying symbols.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static class SymbolTypeId
Visual Basic
Public NotInheritable Class SymbolTypeId
Visual C++
public ref class SymbolTypeId abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SymbolTypeId
See Also
SymbolTypeId Members
Autodesk.Revit.DB Namespace